// 向对象的思维特点:
// 1.抽取(抽象)对象共用的属性和行为組织(封装)成一个类(模板)
// 2.对类进行实例化，获取类的对象
// 面向对象编程我们考虑的是哪些对象,按照面向对象的思维特点不断的创建对象使用对象指挥对象做事情。



// 2.ES6中的类和对象
// 2.1对象
// 现实生活中:万物皆对象,对象是一个具体的事物,看得见摸得着的实物。
// 例如,一本书一辆汽车、一个人可以是对象”,
// —个数据库、一张网页、一个与远程脶务器的连接也可以是“对象”。
// 在 JavaScript中,对象是一组无序的相关属性和方法的集合,所有的事物都是对象,
// 例如字符串、数值、数组、 函数等
// 对象是由属性和方法组成的：
// ·属性:事物的特征,在对象中用属性来表示(常用名词)
// ·方法:事物的行为,在对象中用方法来表示(常用动词)



// 2.2类
// 类抽象了对象的公共部分,它泛指某一大类(class)
// 对象特指某一个,通过类实例化一个具体的对象
// 面向对象的思维特点：
// 1.抽取(抽象)对象共用的属性和行为组织封装)成一个类(模板）
// 2.对类进行实例化，获取类的对象

