// 1.面向对象编程介绍
// 1.1面向过程编程PoP( Process- oriented programming)
// 面向过程就是分析出解決问题所需要的步骤,然后用函数把这些步骤步—步实现,
// 使用的时候再一个一个的依次调用就可以
// 举个栗子:将大象装进冰箱,面向过程做法。
// 1.打开冰箱门
// 2大象装进去
// 3.关上冰箱门
// 面向过程,就是按照我们分析好了的步骤,按照步骤解决问题。



// 1.2面向对象编程 oop(Object Oriented Programming)
// 面向对象是把事务分解成为一个个对象,然后由对象之间分工与合作。
// 举个栗子:将大象装进冰箱,面向对象做法
// 先找出对象,并写出这些对象的功能:
// 1.大象对象
// 进去
// 2.冰箱对象
// 打开
// 关闭
// 3.使用大象和冰箱的功能
// 面向对象是以对象功能来划分问题,而不是步骤。


// 1.3面向对象编程ooP( Object Oriented Programming)
// 在面向对象程序开发思想中,每一个对象都是功能中心,具有明确分工。
// 对象编程具有灵活、代码可复用、容易维护和开发的优点,更适合多人合作的大型软件
// 面向对象的特性
// 封装性
// 继承性
// 多态性




// 14面向过程和面向对象的对比
// 面向过程
// 优点:性能比面向对象高,适合跟硬件联系很紧密的
// 东西,例如单片机就采用的面向过程编程。
// 缺点：没有面向对象易维护易复用、易扩展。


// 面向对象
// 优点:易维护、易复用、易扩展,由于面向对象有封装、继承、多态性的特性，
// 可以设计出低耦合的系统,使系统更加灵活、更加易于维护。
// 缺点:性能比面向过程低

// 用面向过程的方法写出来的程序是一份蛋炒饭,而用面向对象写出来的程序是一份盖浇饭